[
  {
    "title": "PDCA: Планування (Plan)",
    "description": "Ваша команда отримала новий проєкт із чіткими термінами. Які дії на етапі планування ви оберете?",
    "options": [
      {
        "text": "Відразу роздати завдання без узгодження деталей",
        "feedback": "❌ Це не відповідає етапу Plan. Без ретельного плану ви ризикуєте отримати хаотичні результати."
      },
      {
        "text": "Разом із командою визначити цілі, завдання та критерії успіху",
        "feedback": "✅ Це правильний підхід для етапу Plan — ви створюєте основу для ефективного виконання."
      },
      {
        "text": "Чекати, доки керівництво вище сформулює план замість вас",
        "feedback": "⚠️ Пасивність суперечить суті PDCA. Менеджер має брати активну роль у плануванні."
      }
    ]
  },
  {
    "title": "PDCA: Виконання (Do)",
    "description": "Команда почала роботу над планом. Як ви організуєте виконання?",
    "options": [
      {
        "text": "Регулярно перевіряти прогрес, надавати ресурси і допомагати долати труднощі",
        "feedback": "✅ Це правильний підхід для етапу Do — ви підтримуєте команду, забезпечуєте ресурси й умови."
      },
      {
        "text": "Залишити команду сам на сам із завданням, щоб не відволікати",
        "feedback": "❌ Це може призвести до проблем, бо відсутність підтримки знизить ефективність."
      },
      {
        "text": "Змінювати план на ходу, не пояснюючи причини",
        "feedback": "⚠️ Це руйнує стабільність етапу Do. Зміни можливі, але потребують пояснень та узгодження."
      }
    ]
  },
  {
    "title": "PDCA: Перевірка (Check)",
    "description": "Проєкт наближається до завершення. Які дії на етапі перевірки ви зробите?",
    "options": [
      {
        "text": "Порівняти фактичні результати з планом та критеріями успіху",
        "feedback": "✅ Правильно — це сутність етапу Check. Ви аналізуєте, чи досягнуто цілі."
      },
      {
        "text": "Ігнорувати відхилення від плану, аби не витрачати час",
        "feedback": "❌ Це хибно — ви втратите можливість навчитися на помилках."
      },
      {
        "text": "Звалити всю перевірку на одного члена команди",
        "feedback": "⚠️ Це неправильно — перевірка має бути спільною, щоб усі розуміли результати."
      }
    ]
  },
  {
    "title": "PDCA: Дії (Act)",
    "description": "Проєкт завершено. Які кроки ви зробите на етапі Act?",
    "options": [
      {
        "text": "Зробити висновки, узагальнити досвід і впровадити покращення в майбутні процеси",
        "feedback": "✅ Це правильна дія для етапу Act. Вона дозволяє вдосконалювати процеси й уникати минулих помилок."
      },
      {
        "text": "Забути про проєкт і відразу перейти до наступного",
        "feedback": "❌ Це суперечить Act — без аналізу досвіду ви повторюватимете ті самі помилки."
      },
      {
        "text": "Відкласти аналіз на невизначений час",
        "feedback": "⚠️ Це небезпечно — ви втрачаєте шанс закріпити отримані уроки."
      }
    ]
  }
]
